{
  "index": "d2",
  "title": "思科Meraki诠释简化的力量 智能简捷IT驱动企业高质量发展",
  "date": "",
  "file": {},
  "content": [
    {
      "type": "link",
      "message": "https://www.cisco.com/c/zh_cn/about/press/2021/03-22.html"
    },
    {
      "type": "message",
      "message": "2021年3月22日，北京——随着2020年远去，现代商业理念已悄然改变，各行各业掀起了由线下迁移至线上的数字化浪潮。当全球经济逐渐复苏，“线上+线下”的混合办公模式迅速兴起，线上平台交易也与日俱增，数字化创新俨然成为企业生存与发展的必由之路。历经15年行业积淀，思科Meraki专注于简化而强大的技术，为客户带来更低的成本、更快的速度、更简单的管理方式，引领数字化变革，焕发创新活力，助其适应经济发展的新常态。"
    },
    {
      "type": "message",
      "message": "自2018年正式落地中国以来，思科Meraki 简而快捷SaaS云网络管理平台（以下简称“Meraki平台”）凭借灵活性、可扩展性、快捷性、简易性及安全性等优势，协助IT团队简化部署和运营，建立能够响应业务需求的网络，实现降本提效，帮助企业从激烈的市场竞争中脱颖而出。同时，思科Meraki将无线局域网、交换机、路由器及传感器等产品整合为智能IT解决方案，支持用户通过一个简易、智能、基于Web的控制面板管理所有产品。至今，思科Meraki累积服务来自190多个国家的576,000家企业，并多次荣获红点设计大奖，赢得了制造、零售、服务和酒店等多个行业客户的高度认可。"
    },
    {
      "type": "title",
      "message": "功能强大的Meraki平台"
    },
    {
      "type": "message",
      "message": "作为思科Meraki的核心平台，智能云化的Meraki平台不断地适应日新月异的数字化转型趋势，将强大的技术化繁为简，加速企业智能化升级。该平台通过现代的云原生技术构建，提供云优先操作、开放API、广泛的应用程序和合作伙伴生态系统等功能，为用户提供一个基于云的直观界面来简捷、安全地管理整个网络。目前，Meraki平台在全球范围内得到了验证，99.99%的SLA覆盖超过的300万个网络和1.5亿的终端设备，每日服务页面为2.5亿，每日外部API请求多达1.47亿，报告的错误数同比下降30%。"
    },
    {
      "type": "message",
      "message": "作为功能强大的云网络管理平台，Meraki平台从数字化创新和变革等维度赋能企业业务的飞速发展。一方面，Meraki平台设计精巧，具有可扩展性、简单性和集中管理的特点，为企业带来即插即用的体验。该平台还能够从庞大的数据集不断汲取新的发现，提供深入的见解和分析。另一方面，该平台支持企业释放运维压力，让团队更加专注于优化业务流程，追求更高的客户满意度。而且，Meraki平台能够与广泛的网络、应用程序和设备紧密集成，实现更快地部署、管理和故障排除，并通过自动执行多项操作来改善客户体验。"
    },
    {
      "type": "message",
      "message": "如今，Meraki平台已拥有丰富的行业应用，成功地帮助各行业客户降低运营成本、扩大规模及提升效率，进一步地扩大市场占有率。通过API方式运行脚本和模版，Meraki能够在10分钟完成1,000家门店的上线配置。利用Meraki的 “即插即用” 15分钟开店特色，制造业企业可以快速安装部署运维，零售业企业可以快速开店和扩展，仅需几个工作日即可完成十多家门店的网络部署。依托Meraki平台，服务业企业能够通过系统控制面板一键安装管理所有设备，酒店企业能够搭建专属网络，为宾客提供流畅的网络体验。在疫情期间，思科Meraki零接触部署方案（包括无线接入点、开箱即用的位置分析、全栈产品等）帮助酒店等行业客户实现快速远程部署，减少安装人员接触，避免交叉感染。"
    },
    {
      "type": "title",
      "message": "简单的智能管理传感器"
    },
    {
      "type": "message",
      "message": "近日，思科Meraki MT 传感器正式发布，将协同功能强大的Meraki 平台及领先的Wi-Fi 6产品支持企业提升管理能力，保障业务弹性和安全性。思科Meraki MT 传感器包含三个型号，分别为基于云技术的SaaS管理室内温湿度检测传感器（Cisco Meraki MT10）、室内漏水检测传感器（Cisco Meraki MT12）和室内开/关传感器（Cisco Meraki MT20）。借助思科Meraki MT 传感器，企业能够实时查看环境条件，简化对 IT 基础设施、资产和设施的监控，保证其正常运行，并无缝保护物联网设备安全。"
    },
    {
      "type": "message",
      "message": "此外，思科Meraki已推出下一代Wi-Fi产品，即融合Wi-Fi 6技术的无线接入点，提升网络效率、灵活性和可扩展性，满足下一代应用对网络速度与容量的更高要求，带领企业迈入沉浸式无线体验新时代。凭借更快的连接速度、更大的用户容量以及更广的覆盖范围，思科Meraki无线接入点能够帮助企业实现无缝的用户体验。当前，诸如Meraki MR36、Meraki MR44、Meraki MR46和Meraki MR56等新款无线接入点均可支持客户端密度较高的室内外环境（如学校），轻松完成大规模的性能监控和保护，并提供有关客户端设备的见解，从而识别位置感知软件解决方案，改善用户体验。"
    },
    {
      "type": "message",
      "message": "一直以来，思科Meraki始终站在技术前沿，坚持产品改进与升级，逐渐收获来自业界与市场的多方赞誉。据统计，与传统网络架构相比，Meraki平台帮助客户节省了70%的运营成本，包括时间成本、投入成本和人力成本，推动企业实现利润增长。"
    },
    {
      "type": "message",
      "message": "峥荷赛车董事长周小徐表示：“依托思科 Meraki平台，我们实现了简单、高效且智能化的管理，大幅地缓解了我们的IT运维压力。我相信，此次深度合作一定会激发峥荷更多的速度与激情，梦想一定会顺利实现，未来无限可期。”"
    },
    {
      "type": "message",
      "message": "思科大中华区资深副总裁、大中华区新兴业务总经理林向阳表示：“思科Meraki能够让强大的网络技术化繁为简，释放企业在人员、资金、时间等多方面资源的潜力。在这个快速发展的市场中，交货时间对客户来说非常关键，思科Meraki可以在几天内满足客户的部署需求，让他们专注于业务增长，开拓更广泛的市场。”"
    },
    {
      "type": "message",
      "message": "目前，思科Meraki正重磅推出促销计划，即买 8 个 Meraki Wi-Fi 6 产品，就能免费获得1个任意型号的 Meraki 智能管理传感器和1年许可证。此外，购买思科Meraki精选 MR、MS和MX系列产品可享额外折扣支持。本次促销活动预计截止到2021年7月31日。更多详情欢迎访问思科Meraki官方网站。"
    },
    {
      "type": "title",
      "message": "关于思科"
    },
    {
      "type": "message",
      "message": "思科（NASDAQ：CSCO）是全球科技领导厂商。思科通过创新应用程序，保护数据安全，促进基础架构转型，并赋能您的团队实现全球化及包容性的未来，激发无限创新可能。您可以在cisco.com.cn获取更多信息，并关注我们的微信公众号“思科联天下”。"
    },
    {
      "type": "message",
      "message": "思科和思科徽标是思科或其附属机构在美国和其他国家地区的商标或注册商标。您可以查看Cisco商标列表www.cisco.com/go/trademarks，其中提及的第三方商标是其各自所有者的财产。使用“伙伴”一词并不能直接表示思科与任何其他公司之间存在合作关系。"
    }
  ]
}
