<template>
  <div class="home">
    <el-row>
      <el-carousel height="500px" direction="vertical" :autoplay="false">
        <el-carousel-item
          :style="{
            background: `url(${home}) center 25%/100%`,
          }"
        >
          <div class="bigTitle">天时&nbsp;地利&nbsp;人和</div>
          <div class="bigInfo">——做有品质的ICT服务商</div>
        </el-carousel-item>
      </el-carousel>
    </el-row>
    <el-row class="resolve">
      <div class="top">
        <p class="title">解决方案</p>
        <p class="info">致力于为客户提供优质解决方案</p>
      </div>
      <div class="content">
        <el-carousel type="card" height="35vh">
          <el-carousel-item v-for="item in 4" :key="item">
            <el-card
              class="card"
              style="height: 35vh; display: flex; align-items: center"
            >
              <el-row type="flex" align="center" justify="space-between">
                <el-col :span="12">
                  <el-image fit="fill" :src="partner[0].url" />
                </el-col>
                <el-col :span="12">
                  <p class="title">企业网络</p>
                  <p class="info">CORPORATE NETWORK</p>
                  <p class="message">致力于xxxx</p>
                </el-col>
              </el-row>
            </el-card>
          </el-carousel-item>
        </el-carousel>
        <!--
        <el-card class="card">
          <svg
            class="icon"
            viewBox="0 0 1024 1024"
            xmlns="http://www.w3.org/2000/svg"
            width="291.2109375"
            height="200"
          >
            <path
              d="M1001.023998 743.999997l-55.04 0 0-181.567999c0-35.392-28.608-64-64-64l-307.007999 0 0-115.328 120.448 0c12.672 0 22.912-9.664 22.912-21.568l0-339.839999c0-11.968-10.24-21.632-22.912-21.632l-366.847999 0c-12.608-0.064-22.912 9.6-22.912 21.568l0 339.839999c0 11.904 10.304 21.568 22.912 21.568l118.4 0 0 115.392-306.943999 0c-35.328 0-64 28.608-64 64l0 181.503999-53.12 0c-12.672 0.064-22.912 9.728-22.912 21.696l0 236.799999c0 11.904 10.24 21.568 22.912 21.568l244.479999 0c12.736 0 22.976-9.664 22.976-21.568l0-236.799999c0-11.968-10.24-21.632-22.976-21.632l-63.36 0 0-117.568 243.007999 0 0 117.568-57.344 0c-12.672 0-22.976 9.664-22.976 21.632l0 236.735999c0 11.968 10.304 21.632 22.976 21.632l244.479999 0c12.736 0 22.976-9.664 22.976-21.568l0-236.799999c0-11.968-10.24-21.632-22.976-21.632l-59.2 0 0-117.568 243.007999 0 0 117.568-61.44 0c-12.672 0-22.976 9.664-22.976 21.632l0 236.735999c0 11.904 10.304 21.568 22.976 21.568l244.479999 0c12.736 0.064 22.976-9.6 22.976-21.504l0-236.799999c0-11.968-10.24-21.632-22.976-21.632z"
              p-id="3191"
            ></path>
          </svg>
          <p class="title">企业网络</p>
          <p class="info">CORPORATE NETWORK</p>
          <p class="message">致力于xxxx</p>
        </el-card>
        <el-card class="card">
          <svg
            class="icon"
            viewBox="0 0 1491 1024"
            xmlns="http://www.w3.org/2000/svg"
            xmlns:xlink="http://www.w3.org/1999/xlink"
            width="291.2109375"
            height="200"
          >
            <path
              d="M1456.355556 699.103912c0 170.204827-138.466367 308.648621-308.671195 308.648621H355.735296C166.004318 1007.752533 11.646147 853.394362 11.646147 663.685958c0-138.917839 84.402632-262.711377 208.286464-316.120477C248.804226 207.090064 373.410412 101.129659 522.305776 101.129659c49.413576 0 97.35987 11.783411 140.294827 33.747508A344.044002 344.044002 0 0 1 929.194636 8.05877C1118.925614 8.05877 1273.283785 162.416941 1273.283785 352.147918c0 21.016007-1.941328 41.919146-5.778837 62.506256 110.858874 46.885335 188.850608 156.773544 188.850608 284.449738z m-308.422886-218.489724a252.598411 252.598411 0 0 0 35.147071-128.46627c0-140.227107-113.657998-253.885105-253.885105-253.885105-111.129757 0-205.351898 71.513116-239.754041 170.972329a218.038253 218.038253 0 0 0-167.134819-77.90144c-120.678383 0-218.512298 97.833915-218.512298 218.467151 0 1.805887 0.225736 3.521479 0.270883 5.304793-115.418738 23.882852-202.236744 126.073469-202.236744 248.580312 0 140.204533 113.657998 253.907679 253.907679 253.907679h791.949065c120.678383 0 218.489724-97.833915 218.489724-218.489725 0-120.610662-97.6759-218.376857-218.241415-218.489724z m-0.248309 382.080491H355.735296c-109.707621 0-198.963574-89.278527-198.963574-199.008721 0-93.883538 66.614648-175.82565 158.398842-194.832608a30.068015 30.068015 0 1 1 12.189736 58.871909c-64.041259 13.250694-110.475123 70.429584-110.475123 135.960699a139.008133 139.008133 0 0 0 138.850119 138.872692h791.949065a103.567606 103.567606 0 0 0 103.454738-103.454738 103.567606 103.567606 0 0 0-103.34187-103.432164 30.068015 30.068015 0 0 1 0.045147-60.136029h0.022574c90.091176 0.090294 163.410178 73.477018 163.410178 163.568193 0 90.18147-73.386723 163.590767-163.590767 163.590767z m-73.002972-395.105449a30.068015 30.068015 0 0 1-25.891902-45.327758 138.330926 138.330926 0 0 0 19.277841-70.113554 139.008133 139.008133 0 0 0-138.872692-138.850118 138.73725 138.73725 0 0 0-131.017084 93.499787 30.090588 30.090588 0 0 1-56.862859-19.639018 199.008721 199.008721 0 0 1 187.879943-133.996798c109.752768 0 199.008721 89.278527 199.008722 198.986147 0 35.169645-9.548626 69.978112-27.584921 100.63304a30.068015 30.068015 0 0 1-25.937048 14.808272z m-473.232626-124.267583a103.296723 103.296723 0 0 0-79.142987-36.952958c-56.29852 0-102.70981 45.779229-103.477312 102.032602a30.022867 30.022867 0 0 1-30.045441 29.66169h-0.428898a30.068015 30.068015 0 0 1-29.639116-30.474339c1.218974-88.962497 74.583123-161.378556 163.590767-161.378556 48.307471 0 93.906112 21.309464 125.125379 58.37529a30.068015 30.068015 0 0 1-45.982392 38.736271z"
              p-id="1139"
              class="svg"
            ></path>
          </svg>
          <p class="title">云计算</p>
          <p class="info">CLOUD COMPUTING</p>
          <p class="message">致力于xxxx</p>
        </el-card>-->
      </div>
    </el-row>

    <el-row class="teamwork">
      <div class="top">
        <p class="title">合作伙伴</p>
        <p class="info">
          深圳市天地和网络有限公司已经与HUAWEI、Cisco、H3C、Uniview、IBM等国内外优秀企业结为重要的战略合作伙伴关系，双方优势互补，合作共赢，共同推动中国网络产业发展。
        </p>
      </div>
      <el-row class="content">
        <el-col :span="6" v-for="(item, index) in brand" :key="index">
          <el-image fit="scale-down" style="height: 10vh" :src="item.url" />
        </el-col>
      </el-row>
    </el-row>

    <el-row class="honor">
      <div class="top">
        <p class="title">公司资质</p>
      </div>
      <el-carousel :interval="2000" type="card" height="50vh">
        <el-carousel-item v-for="(item, index) in honor" :key="index">
          <el-image
            fit="scale-down"
            style="height: 50vh"
            :src="item.url"
            :preview-src-list="listUrl"
          />
        </el-carousel-item>
      </el-carousel>
    </el-row>
  </div>
</template>

<script>
import cloud from "@/assets/icon-cloud.svg";
import home from "@/image/home.jpg";
import { brand, partner } from "@/image/home/homeImage";

import fxgj from "@/image/honor/fxgj.png";
import H3C from "@/image/honor/H3C.jpg";
import hw3z from "@/image/honor/hw3z.png";
import hzhb from "@/image/honor/hzhb.png";

export default {
  name: "Home",
  components: {},
  data() {
    return {
      home,
      cloud,
      // img: [{ url: "" }],
      brand: brand,
      partner: partner,
      honor: [
        {
          url: fxgj,
        },
        {
          url: H3C,
        },
        {
          url: hw3z,
        },
        {
          url: hzhb,
        },
      ],
      listUrl: [fxgj, H3C, hw3z, hzhb],
    };
  },
};
</script>

<style lang="scss" scoped>
@import "~@/style/home.scss";
</style>
